<?php
/* Задание-3. Начало */
$district = [
    'Московская область'=> ['Москва', 'Зеленоград', 'Клин'],
    'Ленинградская область' => ['Санкт-Петербург', 'Всеволожск', 'Павловск', 'Кронштадт'],
    'Самарская область' => ['Самара', 'Новокуйбышевск', 'Отрадный'],
];

function kladr($district) {
    foreach ($district as $key => $value) {
        echo $key . ": <br>";
        $res = '';
        for ($i = 0; $i <= count($value); $i++) {
            $res .= $value[$i] . ',';
        }
        $res = substr_replace($res,'.',-2);
        echo $res . '<br>';
    }
}
/* Задание-3. Конец */
?>

<h2>Задание 3</h2>
<p><?=kladr($district)?></p>
